#### Terraform Plan
```
module.edge.cloudflare_d1_database.global_db: Refreshing state... [id=71f876c0-dc58-4664-9fee-b34f4091709e]
google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/cloudresourcemanager.googleapis.com]
google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/iam.googleapis.com]
google_project_service.apis["aiplatform.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/aiplatform.googleapis.com]
google_project_service.apis["storage.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/storage.googleapis.com]
google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/pubsub.googleapis.com]
google_project_service.apis["compute.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/compute.googleapis.com]
google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/artifactregistry.googleapis.com]
google_project_service.apis["earthengine.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/earthengine.googleapis.com]
google_project_service.apis["bigquery.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/bigquery.googleapis.com]
google_project_service.apis["eventarc.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/eventarc.googleapis.com]
google_project_service.apis["cloudscheduler.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/cloudscheduler.googleapis.com]
google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=hyperlocal-wx-prod/run.googleapis.com]
module.edge.cloudflare_pages_project.wx_frontend: Refreshing state... [id=hyperlocal-wx-app]
module.edge.cloudflare_worker_script.api_gateway: Refreshing state... [id=wx-api-gateway]
module.edge.cloudflare_record.city_dns["salt-lake-city"]: Refreshing state... [id=7d85ed20117d4445d3b5d1f8aebfa25f]
module.edge.cloudflare_record.city_dns["durango"]: Refreshing state... [id=01cc05e1792f850aff5bb5f82d823e68]
module.edge.cloudflare_record.city_dns["denver"]: Refreshing state... [id=afde87271f37ac2c5379fc8f6f5d4d56]
module.edge.cloudflare_worker_route.api_routes["durango"]: Refreshing state... [id=b1a2f1c25c914a558fd71998ba0c40ea]
module.edge.cloudflare_worker_route.api_routes["denver"]: Refreshing state... [id=e11ee3c9e64a4d99afdff1a8b7f47b07]
module.edge.cloudflare_worker_route.api_routes["salt-lake-city"]: Refreshing state... [id=b472f9fa8ce24a87a4418081649174ba]
module.edge.cloudflare_pages_domain.city_domains["denver"]: Refreshing state... [id=3817050e-52d3-4ddc-97a0-40e9dedaef4f]
module.edge.cloudflare_pages_domain.city_domains["durango"]: Refreshing state... [id=88913d92-1083-45fd-a168-16aa65001a3d]
module.edge.cloudflare_pages_domain.city_domains["salt-lake-city"]: Refreshing state... [id=b2dff2ca-b334-4a94-accd-49a10c65c276]
module.ingestion.google_project_iam_member.deploy_ci_writer: Refreshing state... [id=hyperlocal-wx-prod/roles/artifactregistry.writer/serviceAccount:deploy-ci@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_service_account.ml_sa: Refreshing state... [id=projects/hyperlocal-wx-prod/serviceAccounts/llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.notifications.google_pubsub_topic.drift_alerts: Refreshing state... [id=projects/hyperlocal-wx-prod/topics/model-drift-alerts]
module.ingestion.google_project_iam_member.deploy_ci_run_admin: Refreshing state... [id=hyperlocal-wx-prod/roles/run.admin/serviceAccount:deploy-ci@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ingestion.google_artifact_registry_repository.wx_repo: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/repositories/weather-services]
module.ingestion.google_project_iam_member.deploy_ci_sa_user: Refreshing state... [id=hyperlocal-wx-prod/roles/iam.serviceAccountUser/serviceAccount:deploy-ci@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.notifications.google_pubsub_topic.commentary_ready: Refreshing state... [id=projects/hyperlocal-wx-prod/topics/commentary-ready]
module.notifications.google_pubsub_topic.subscriber_notifications: Refreshing state... [id=projects/hyperlocal-wx-prod/topics/subscriber-notifications]
module.analytics.google_bigquery_dataset.weather_core: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core]
module.ingestion.google_service_account.ingest_sa: Refreshing state... [id=projects/hyperlocal-wx-prod/serviceAccounts/nwp-ingest-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_project_iam_member.vertex_ai_user: Refreshing state... [id=hyperlocal-wx-prod/roles/aiplatform.user/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_project_iam_member.bq_reader: Refreshing state... [id=hyperlocal-wx-prod/roles/bigquery.dataViewer/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ml_and_jobs.google_project_iam_member.bq_writer: Refreshing state... [id=hyperlocal-wx-prod/roles/bigquery.dataEditor/serviceAccount:llm-and-gee-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ingestion.google_project_iam_member.ingest_bq_writer: Refreshing state... [id=hyperlocal-wx-prod/roles/bigquery.dataEditor/serviceAccount:nwp-ingest-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.analytics.google_bigquery_table.verification_scores_view: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/verification_scores]
module.analytics.google_bigquery_table.terrain_context: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/terrain_context]
module.analytics.google_bigquery_table.ground_truth: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/ground_truth]
module.analytics.google_bigquery_table.model_drift_view: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/model_drift]
module.analytics.google_bigquery_table.forecast_runs: Refreshing state... [id=projects/hyperlocal-wx-prod/datasets/weather_core/tables/forecast_runs]
module.ml_and_jobs.google_cloud_run_v2_service.llm_commentary: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/gemini-forecast-commentary]
module.ingestion.google_cloud_run_v2_service.grib_parser: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/grib2-byte-parser]
module.ingestion.google_cloud_run_v2_service_iam_member.pubsub_invoker: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/grib2-byte-parser/roles/run.invoker/serviceAccount:nwp-ingest-sa@hyperlocal-wx-prod.iam.gserviceaccount.com]
module.ingestion.google_cloud_scheduler_job.nam_ingest_schedule: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/nam-ingest-trigger]
module.ingestion.google_cloud_scheduler_job.gfs_ingest_schedule: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/gfs-ingest-trigger]
module.ml_and_jobs.google_cloud_run_v2_service_iam_member.commentary_public: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/services/gemini-forecast-commentary/roles/run.invoker/allUsers]
module.ml_and_jobs.google_cloud_scheduler_job.gee_terrain_refresh: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/gee-annual-terrain-refresh]
module.ml_and_jobs.google_cloud_scheduler_job.commentary_generation: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/commentary-generation-trigger]
module.ml_and_jobs.google_cloud_scheduler_job.gee_verification: Refreshing state... [id=projects/hyperlocal-wx-prod/locations/us-central1/jobs/gee-daily-rtma-verification]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.analytics.google_bigquery_table.grid_points_sampled will be created
  + resource "google_bigquery_table" "grid_points_sampled" {
      + allow_resource_tags_on_deletion = false
      + clustering                      = [
          + "model_name",
          + "run_time",
          + "tile_id",
        ]
      + creation_time                   = (known after apply)
      + dataset_id                      = "weather_core"
      + deletion_protection             = true
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "hyperlocal-wx-prod"
      + schema                          = jsonencode(
            [
              + {
                  + mode = "REQUIRED"
                  + name = "model_name"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "run_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "valid_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "tile_id"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "city_slug"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "lat"
                  + type = "FLOAT"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "lon"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "temperature_2m"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "precip_kg_m2"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "wind_u_10m"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "wind_v_10m"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "snow_depth"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "relative_humidity"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "ingest_id"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "created_at"
                  + type = "TIMESTAMP"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "grid_points_sampled"
      + terraform_labels                = (known after apply)
      + type                            = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "valid_time"
          + type          = "DAY"
        }
    }

  # module.analytics.google_bigquery_table.grid_tile_fields will be created
  + resource "google_bigquery_table" "grid_tile_fields" {
      + allow_resource_tags_on_deletion = false
      + clustering                      = [
          + "model_name",
          + "run_time",
          + "tile_id",
          + "field_name",
        ]
      + creation_time                   = (known after apply)
      + dataset_id                      = "weather_core"
      + deletion_protection             = true
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "hyperlocal-wx-prod"
      + schema                          = jsonencode(
            [
              + {
                  + mode = "REQUIRED"
                  + name = "model_name"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "run_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "valid_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "tile_id"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "field_name"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "unit"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "gcs_uri"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "compression"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "min_value"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "max_value"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "mean_value"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "null_count"
                  + type = "INTEGER"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "ingest_id"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "created_at"
                  + type = "TIMESTAMP"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "grid_tile_fields"
      + terraform_labels                = (known after apply)
      + type                            = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "valid_time"
          + type          = "DAY"
        }
    }

  # module.analytics.google_bigquery_table.grid_tiles will be created
  + resource "google_bigquery_table" "grid_tiles" {
      + allow_resource_tags_on_deletion = false
      + clustering                      = [
          + "model_name",
          + "run_time",
          + "tile_id",
        ]
      + creation_time                   = (known after apply)
      + dataset_id                      = "weather_core"
      + deletion_protection             = true
      + effective_labels                = (known after apply)
      + etag                            = (known after apply)
      + expiration_time                 = (known after apply)
      + id                              = (known after apply)
      + last_modified_time              = (known after apply)
      + location                        = (known after apply)
      + num_bytes                       = (known after apply)
      + num_long_term_bytes             = (known after apply)
      + num_rows                        = (known after apply)
      + project                         = "hyperlocal-wx-prod"
      + schema                          = jsonencode(
            [
              + {
                  + mode = "REQUIRED"
                  + name = "model_name"
                  + type = "STRING"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "run_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "valid_time"
                  + type = "TIMESTAMP"
                },
              + {
                  + mode = "REQUIRED"
                  + name = "tile_id"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "min_lat"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "min_lon"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "max_lat"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "max_lon"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "resolution_deg"
                  + type = "FLOAT"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "row_count"
                  + type = "INTEGER"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "col_count"
                  + type = "INTEGER"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "gcs_prefix"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "ingest_id"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "created_at"
                  + type = "TIMESTAMP"
                },
            ]
        )
      + self_link                       = (known after apply)
      + table_id                        = "grid_tiles"
      + terraform_labels                = (known after apply)
      + type                            = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "valid_time"
          + type          = "DAY"
        }
    }

  # module.ingestion.google_cloud_run_v2_service.grib_parser will be updated in-place
  ~ resource "google_cloud_run_v2_service" "grib_parser" {
      - client                  = "gcloud" -> null
      - client_version          = "557.0.0" -> null
        id                      = "projects/hyperlocal-wx-prod/locations/us-central1/services/grib2-byte-parser"
        name                    = "grib2-byte-parser"
        # (25 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "c37bae6c27eb054f652885a8a40037b3080b5ae7" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (5 unchanged attributes hidden)

          ~ containers {
              ~ image      = "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/grib2-parser:c37bae6c27eb054f652885a8a40037b3080b5ae7" -> "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/grib2-parser:latest"
                # (3 unchanged attributes hidden)

                # (6 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.ml_and_jobs.google_cloud_run_v2_service.llm_commentary will be updated in-place
  ~ resource "google_cloud_run_v2_service" "llm_commentary" {
      - client                  = "gcloud" -> null
      - client_version          = "557.0.0" -> null
        id                      = "projects/hyperlocal-wx-prod/locations/us-central1/services/gemini-forecast-commentary"
        name                    = "gemini-forecast-commentary"
        # (25 unchanged attributes hidden)

      ~ template {
          ~ labels                           = {
              - "commit-sha" = "9ac683cb294d509f6ea6c7c37b29f48b3909c8d1" -> null
              - "managed-by" = "github-actions" -> null
            }
            # (5 unchanged attributes hidden)

          ~ containers {
              ~ image      = "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/llm-commentary:9ac683cb294d509f6ea6c7c37b29f48b3909c8d1" -> "us-central1-docker.pkg.dev/hyperlocal-wx-prod/weather-services/llm-commentary:latest"
                # (3 unchanged attributes hidden)

                # (5 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.edge.cloudflare_record.city_dns["salt-lake-city"],
  on modules/edge/main.tf line 40, in resource "cloudflare_record" "city_dns":
  40:   value   = "${cloudflare_pages_project.wx_frontend.name}.pages.dev"

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and 2 more similar warnings elsewhere)

Warning: Deprecated Resource

  with module.edge.cloudflare_worker_script.api_gateway,
  on modules/edge/main.tf line 57, in resource "cloudflare_worker_script" "api_gateway":
  57: resource "cloudflare_worker_script" "api_gateway" {

`cloudflare_worker_script` is now deprecated and will be removed in the next
major version. Use `cloudflare_workers_script` instead.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
*Triggered by @jpoehnelt-bot*